#include <stdio.h>
#include <float.h>
#include <math.h>

int main()
{
    /**** 例2.3 输出简单计算表达式的计算结果 ****/
    //    printf("Volume = %f cm^3\n",(3.1416 * 6.5 * 6.5 * 6.5) * 4.0 / 3.0 );

    /**** 整除与取模 ****/
    //    printf("11 / 5 = %d, 11 %% 5 = %d\n", 11 / 5, 11 % 5);
    //    printf("11 / -5 = %d, 11 %% -5 = %d\n", 11 / -5, 11 % -5);
    //    printf("-11 / -5 = %d, -11 %% -5 = %d\n", -11 / -5, -11 % -5);
    //    printf("-11 / 5 = %d, -11 %% 5 = %d\n", -11 / 5, -11 % 5);

    /**** 计算与类型 (1) ****/
        printf("%d\t%d\n", (14 / 8 * 12, 14 * 12 / 8)); // 有些地方不能随便加括号!
        printf("%f\n", 14 / 8 * 12);

    /**** 溢出与计算误差 ****/
    //    printf("%d + %d = %d\n", 0x7FFFFFFF, 1, 0x7FFFFFFF + 1); // 整数溢出，但有符号整数没有确定的溢出规则
    //    printf("%f\n", 1.7e308 * 100.); // 双精度数的上溢
    //
    //    printf("%.1f + %.1f = %.1f\n", 1.2e8f, 20.f, 1.2e8f + 20.f); // 很大和很小的数直接相加减
    //    printf("%.1f + %.1f = %.1f\n", 1.2e8, 20., 1.2e8 + 20.);

    /**** 强制类型转换 ****/
    //    printf("%f\n", (float)14 / 8 * 12); // 类型强制的优先级和结合方式同正负号.
    //    printf("%f\n", (float)(14 / 8 * 12));

    /**** 例2.4 数学函数的简单使用 ****/
    //    printf("Area: %f m^2\n", 3.5 * 4.72 * sin(37.0/180 * 3.1416)/2); // 算术表达式作为数学函数的实参

    /**** 例2.5 计算与类型 (2) ****/
    // 	printf("%f\n", sin(1));
    //	printf("%f\n", sin(1) + sin(1/2) + sin(1/3) + sin(1/4) + sin(1/5) + sin(1/6) + sin(1/7) + sin(1/8) + sin(1/9) + sin(1/10));
    //	printf("%f\n", sin(1) + sin(1./2) + sin(1./3) + sin(1./4) + sin(1./5) + sin(1./6) + sin(1./7) + sin(1./8) + sin(1./9) + sin(1./10));

    /**** 例2.6 已知三角形三边长求面积 ****/
    //   printf("Area: %f\n", sqrt((3 + 5 + 7)/2. * ((3 + 5 + 7)/2. - 3) * ((3 + 5 + 7)/2. - 5) * ((3 + 5 + 7)/2. - 7)));

    //   printf("sqrt(%f) = %f\n", -1., sqrt(-1.)); // 非法运算, 结果无定义，NaN(Not a number)

    return 0;
}
